In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: C:\Users\marre\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
import numpy as np

In [3]:
l = ['a', 'b', 'c']
n = [1, 2, 3]
d = {'a': 1, 'b': 2, 'c': 3}
my_arr = np.array(n)
print(my_arr)

[1 2 3]

In [4]:
pd.Series(n)

0    1
1    2
2    3
dtype: int64

In [5]:
pd.Series(data = n, index = l)

a    1
b    2
c    3
dtype: int64

In [6]:
pd.Series(my_arr)

0    1
1    2
2    3
dtype: int64

In [7]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

1.2. Series Attributes and Indexing

In [8]:
s = pd.Series(data = [111, 222, 333, 444], index = ['a', 'b', 'c', 'd'], name='MySeries')

In [9]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
s.name

'MySeries'

In [11]:
s.dtype

dtype('int64')

In [12]:
s.values

array([111, 222, 333, 444])

In [13]:
s[0]

C:\Users\marre\AppData\Local\Temp\ipykernel_16436\243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

np.int64(111)

In [14]:
s['b']

np.int64(222)

In [15]:
s[2:4]

c    333
d    444
Name: MySeries, dtype: int64

In [16]:
s['c']

np.int64(333)

In [17]:
s['d']

np.int64(444)

In [18]:
s[['a', 'c']]

a    111
c    333
Name: MySeries, dtype: int64

In [19]:
s[['a', 'b', 'c']]

a    111
b    222
c    333
Name: MySeries, dtype: int64

1.3 Series Operations

In [20]:
s1 = pd.Series(data = [1, 2, 3, 4], index = ['d', 'b', 'c', 'a'])
s2 = pd.Series(data = [1, 2, 3, 4], index = ['a', 'b', 'd', 'e'])
print(s1)
print(s2)

d    1
b    2
c    3
a    4
dtype: int64
a    1
b    2
d    3
e    4
dtype: int64

In [21]:
s1 + s2

a    5.0
b    4.0
c    NaN
d    4.0
e    NaN
dtype: float64

In [22]:
s1 - s2

a    3.0
b    0.0
c    NaN
d   -2.0
e    NaN
dtype: float64

In [23]:
s1 * s2

a    4.0
b    4.0
c    NaN
d    3.0
e    NaN
dtype: float64

In [24]:
s1 / s2

a    4.000000
b    1.000000
c         NaN
d    0.333333
e         NaN
dtype: float64

In [25]:
s1 // s2

a    4.0
b    1.0
c    NaN
d    0.0
e    NaN
dtype: float64

In [26]:
2*s1

d    2
b    4
c    6
a    8
dtype: int64

In [27]:
3*s2

a     3
b     6
d     9
e    12
dtype: int64

1.4 Series Methods

In [28]:
s1.sum()

np.int64(10)

In [29]:
s1.mean()

np.float64(2.5)

In [30]:
s2.median()

np.float64(2.5)

In [31]:
s1.sort_values()

d    1
b    2
c    3
a    4
dtype: int64

In [32]:
s1.max()

np.int64(4)

In [33]:
s1.std()

np.float64(1.2909944487358056)

In [34]:
s1.sort_index()

a    4
b    2
c    3
d    1
dtype: int64

In [35]:
ser_height = pd.Series([165.3, 170.1, 175.0, 182.1, 168.0, 162.0, 150.6, 167.1, 180.0, 162.2, 169.2, 152.8, 165.9], name = "height")

In [36]:
print(ser_height)

0     165.3
1     170.1
2     175.0
3     182.1
4     168.0
5     162.0
6     150.6
7     167.1
8     180.0
9     162.2
10    169.2
11    152.8
12    165.9
Name: height, dtype: float64

In [37]:
ser_height.apply(lambda x: x/100)

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.506
7     1.671
8     1.800
9     1.622
10    1.692
11    1.528
12    1.659
Name: height, dtype: float64

In [38]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
print(obj1)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [39]:
states = ['California', 'Ohio', 'Oregon', 'Texas', 'Utah']
obj2 = pd.Series(sdata, index = states)
print(obj2)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
dtype: float64

In [40]:
pd.isnull(obj1)

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [41]:
pd.isnull(obj2)

California     True
Ohio          False
Oregon        False
Texas         False
Utah          False
dtype: bool

In [42]:
pd.notnull(obj2)

California    False
Ohio           True
Oregon         True
Texas          True
Utah           True
dtype: bool

In [43]:
obj2.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
Utah          False
dtype: bool

In [44]:
obj2.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
Utah           True
dtype: bool

In [45]:
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [46]:
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
dtype: float64

In [47]:
obj1 + obj2

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah           10000.0
dtype: float64

In [48]:
obj2.name = 'population'
obj2.index.name = 'states'
print(obj2)

states
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
Name: population, dtype: float64

In [49]:
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [50]:
obj1.index = ['Bob', 'Jeff', 'Mark', 'John']

In [51]:
obj1

Bob     35000
Jeff    71000
Mark    16000
John     5000
dtype: int64

DataFrame

In [52]:
import os

In [53]:
data = {'NAME': ['Jake', 'Jennifer', 'Paul', 'Andrew'], 'AGE': [24, 21, 25, 19], 'GENDER': ['M', 'F', 'M', 'M']}
df = pd.DataFrame(data)
print(df)

       NAME  AGE GENDER
0      Jake   24      M
1  Jennifer   21      F
2      Paul   25      M
3    Andrew   19      M

In [54]:
df = pd.DataFrame(np.random.rand(10, 5), columns=['A', 'B', 'C', 'D', 'E'])
df

          A         B         C         D         E
0  0.341472  0.986889  0.767268  0.173904  0.361544
1  0.471983  0.831603  0.238520  0.298164  0.042768
2  0.030711  0.435432  0.698470  0.337938  0.142140
3  0.206797  0.450364  0.635830  0.223859  0.846564
4  0.314681  0.570482  0.535093  0.034777  0.444093
5  0.585160  0.022453  0.146543  0.062748  0.726484
6  0.133441  0.523912  0.491722  0.338334  0.242951
7  0.039874  0.979109  0.929746  0.800122  0.542057
8  0.288608  0.215476  0.790263  0.273910  0.919398
9  0.095838  0.848852  0.550594  0.781257  0.481366

In [55]:
df.head(3)

          A         B         C         D         E
0  0.341472  0.986889  0.767268  0.173904  0.361544
1  0.471983  0.831603  0.238520  0.298164  0.042768
2  0.030711  0.435432  0.698470  0.337938  0.142140

In [56]:
df.tail(3)

          A         B         C         D         E
7  0.039874  0.979109  0.929746  0.800122  0.542057
8  0.288608  0.215476  0.790263  0.273910  0.919398
9  0.095838  0.848852  0.550594  0.781257  0.481366

In [57]:
os.chdir(r"D:\IARE\6th Semester\SamsungInnovation")

In [58]:
df = pd.read_csv("08. data_studentlist.csv", header = 'infer')
df

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [59]:
df.shape

(17, 8)

In [60]:
df.size

136

In [61]:
df.ndim

2

In [62]:
df.columns

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [63]:
df.index

RangeIndex(start=0, stop=17, step=1)

In [64]:
type(df)

pandas.core.frame.DataFrame

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       17 non-null     object
 1   gender     17 non-null     object
 2   age        17 non-null     int64
 3   grade      17 non-null     int64
 4   absence    17 non-null     object
 5   bloodtype  17 non-null     object
 6   height     17 non-null     float64
 7   weight     17 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.2+ KB

In [66]:
df.describe()

             age      grade      height     weight
count  17.000000  17.000000   17.000000  17.000000
mean   22.352941   2.294118  170.035294  61.064706
std     1.169464   1.104802    7.849756  11.851685
min    20.000000   1.000000  155.200000  45.200000
25%    22.000000   1.000000  165.300000  53.000000
50%    22.000000   2.000000  169.200000  61.300000
75%    23.000000   3.000000  176.100000  68.200000
max    24.000000   4.000000  182.100000  85.700000

In [67]:
df.head(5)

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [68]:
df.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [69]:
df.tail()

                name gender  age  grade absence bloodtype  height  weight
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [70]:
header = df.columns
header

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [71]:
df.columns = ['NAME', 'GENDER', 'AGE', 'GRADE', 'ABSENCE', 'BLOODTYPE', 'HEIGHT', 'WEIGHT']
print(df.head(3))

             NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0   Jared Diamond      M   23      3       Y         O   165.3    68.2
1  Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2    Brian Martin      M   24      4       N         B   175.0    80.1

In [72]:
df.NAME

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [73]:
df.AGE

0     23
1     22
2     24
3     23
4     20
5     21
6     22
7     23
8     23
9     22
10    24
11    22
12    21
13    23
14    22
15    24
16    21
Name: AGE, dtype: int64

In [74]:
type(df.NAME)

pandas.core.series.Series

In [75]:
df['NAME']

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [76]:
type(df['NAME'])

pandas.core.series.Series

In [77]:
df[['NAME']]
# This is a dataframe with one column

                NAME
0      Jared Diamond
1     Sarah O'Donnel
2       Brian Martin
3       David Hassel
4    Clara Rodriquez
5   Jennifer Lorentz
6        Susan Clark
7    Margareth Jones
8       John Bertsch
9     Jake Timmerman
10     Joshua Connor
11      John Matsuda
12      Eddy Johnson
13  Rebecah Anderson
14      Linda Carter
15    Richard Swayze
16       Andrew King

In [78]:
type(df[['NAME']])

pandas.core.frame.DataFrame

In [79]:
df.loc[:, 'NAME']

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [80]:
df.loc[:, ['NAME', 'GENDER']]

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [81]:
df.iloc[:, [0, 1]] # Integer indexing in iloc

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [82]:
header = df.columns
df.loc[:, (header == 'NAME') | (header == 'GENDER')]

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [83]:
df.loc[:, (header == 'NAME') & (header == 'GENDER')]
# Doesn't work as expected or taught

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]

In [84]:
df.loc[2]

NAME         Brian Martin
GENDER                  M
AGE                    24
GRADE                   4
ABSENCE                 N
BLOODTYPE               B
HEIGHT              175.0
WEIGHT               80.1
Name: 2, dtype: object

In [85]:
df.head()

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [86]:
df.loc[2:4] # Stop is inclusive

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [87]:
df.iloc[2:4] # Stop is exclusive

           NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
2  Brian Martin      M   24      4       N         B   175.0    80.1
3  David Hassel      M   23      3       N        AB   182.1    85.7

In [88]:
df.drop(columns = ['NAME', 'GENDER'])
# To drop the rows in real-time, use inplace = True parameter, this is just a view

    AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    23      3       Y         O   165.3    68.2
1    22      2       N        AB   170.1    53.0
2    24      4       N         B   175.0    80.1
3    23      3       N        AB   182.1    85.7
4    20      1       Y         A   168.0    49.5
5    21      2       N         O   162.0    52.0
6    22      1       N         O   155.2    45.3
7    23      1       N         A   176.9    55.0
8    23      3       N         B   178.5    64.2
9    22      2       N         B   176.1    61.3
10   24      4       Y         O   167.1    62.0
11   22      2       N        AB   180.0    75.8
12   21      1       N         A   162.2    55.3
13   23      3       N         O   176.1    53.1
14   22      2       N         B   158.2    45.2
15   24      4       Y         B   168.6    70.2
16   21      1       N         A   169.2    62.2

In [89]:
df

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [90]:
header = df.columns
df.loc[:, (header != 'NAME') & (header != 'GENDER')]

    AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    23      3       Y         O   165.3    68.2
1    22      2       N        AB   170.1    53.0
2    24      4       N         B   175.0    80.1
3    23      3       N        AB   182.1    85.7
4    20      1       Y         A   168.0    49.5
5    21      2       N         O   162.0    52.0
6    22      1       N         O   155.2    45.3
7    23      1       N         A   176.9    55.0
8    23      3       N         B   178.5    64.2
9    22      2       N         B   176.1    61.3
10   24      4       Y         O   167.1    62.0
11   22      2       N        AB   180.0    75.8
12   21      1       N         A   162.2    55.3
13   23      3       N         O   176.1    53.1
14   22      2       N         B   158.2    45.2
15   24      4       Y         B   168.6    70.2
16   21      1       N         A   169.2    62.2

In [91]:
# Conditional Slicing
df[df.GENDER == 'M']

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
8     John Bertsch      M   23      3       N         B   178.5    64.2
9   Jake Timmerman      M   22      2       N         B   176.1    61.3
10   Joshua Connor      M   24      4       Y         O   167.1    62.0
11    John Matsuda      M   22      2       N        AB   180.0    75.8
12    Eddy Johnson      M   21      1       N         A   162.2    55.3
15  Richard Swayze      M   24      4       Y         B   168.6    70.2
16     Andrew King      M   21      1       N         A   169.2    62.2

In [92]:
df[df.GENDER != 'M']

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [93]:
df[-(df.GENDER == 'M')]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [94]:
df[~(df.GENDER == 'M')]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [95]:
df[df.GENDER == 'F']

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [96]:
df.loc[df.HEIGHT > 170, 'HEIGHT']

1     170.1
2     175.0
3     182.1
7     176.9
8     178.5
9     176.1
11    180.0
13    176.1
Name: HEIGHT, dtype: float64

In [97]:
df[(df.WEIGHT > 70) & (df.WEIGHT < 80)]

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
11    John Matsuda      M   22      2       N        AB   180.0    75.8
15  Richard Swayze      M   24      4       Y         B   168.6    70.2

In [98]:
df[(df.GENDER == 'M') & (df.AGE > 20)]

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
8     John Bertsch      M   23      3       N         B   178.5    64.2
9   Jake Timmerman      M   22      2       N         B   176.1    61.3
10   Joshua Connor      M   24      4       Y         O   167.1    62.0
11    John Matsuda      M   22      2       N        AB   180.0    75.8
12    Eddy Johnson      M   21      1       N         A   162.2    55.3
15  Richard Swayze      M   24      4       Y         B   168.6    70.2
16     Andrew King      M   21      1       N         A   169.2    62.2

In [99]:
df[~((df.GENDER == 'M') & (df.HEIGHT > 175))]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [100]:
df2 = df.drop(columns = ['GRADE', 'ABSENCE'])
print(df2)

                NAME GENDER  AGE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23         O   165.3    68.2
1     Sarah O'Donnel      F   22        AB   170.1    53.0
2       Brian Martin      M   24         B   175.0    80.1
3       David Hassel      M   23        AB   182.1    85.7
4    Clara Rodriquez      F   20         A   168.0    49.5
5   Jennifer Lorentz      F   21         O   162.0    52.0
6        Susan Clark      F   22         O   155.2    45.3
7    Margareth Jones      F   23         A   176.9    55.0
8       John Bertsch      M   23         B   178.5    64.2
9     Jake Timmerman      M   22         B   176.1    61.3
10     Joshua Connor      M   24         O   167.1    62.0
11      John Matsuda      M   22        AB   180.0    75.8
12      Eddy Johnson      M   21         A   162.2    55.3
13  Rebecah Anderson      F   23         O   176.1    53.1
14      Linda Carter      F   22         B   158.2    45.2
15    Richard Swayze      M   24         B   168.6    70.2
16       Andrew King      M   21         A   169.2    62.2

In [101]:
df2.to_csv('data_mine.csv', index = False)

In [102]:
df3 = pd.read_csv('data_mine.csv', encoding = 'latin1', header = 'infer')
df3

                NAME GENDER  AGE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23         O   165.3    68.2
1     Sarah O'Donnel      F   22        AB   170.1    53.0
2       Brian Martin      M   24         B   175.0    80.1
3       David Hassel      M   23        AB   182.1    85.7
4    Clara Rodriquez      F   20         A   168.0    49.5
5   Jennifer Lorentz      F   21         O   162.0    52.0
6        Susan Clark      F   22         O   155.2    45.3
7    Margareth Jones      F   23         A   176.9    55.0
8       John Bertsch      M   23         B   178.5    64.2
9     Jake Timmerman      M   22         B   176.1    61.3
10     Joshua Connor      M   24         O   167.1    62.0
11      John Matsuda      M   22        AB   180.0    75.8
12      Eddy Johnson      M   21         A   162.2    55.3
13  Rebecah Anderson      F   23         O   176.1    53.1
14      Linda Carter      F   22         B   158.2    45.2
15    Richard Swayze      M   24         B   168.6    70.2
16       Andrew King      M   21         A   169.2    62.2

In [103]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: C:\Users\marre\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [104]:
os.getcwd()

'D:\\IARE\\6th Semester\\SamsungInnovation'

In [105]:
pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (2.0.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: C:\Users\marre\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [106]:
dfx = pd.read_excel('data_studentlist.xls')
dfx

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [107]:
dfx.to_excel('data_studentslist2.xlsx', sheet_name='NewSheet', index = False)

In [108]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2003, 2002, 2001], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3    Ohio  2003  2.4
4  Nevada  2002  2.9
5  Nevada  2001  3.2

In [109]:
exam_data = {'name': ['stu1', 'stu2', 'stu3'], 'math': [90, 80, 70], 'eng': [98, 89, 95], 'music': [85, 95, 100], 'science': [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   name  math  eng  music  science
0  stu1    90   98     85      100
1  stu2    80   89     95       90
2  stu3    70   95    100       90

In [110]:
df = df.transpose()
print(df)

            0     1     2
name     stu1  stu2  stu3
math       90    80    70
eng        98    89    95
music      85    95   100
science   100    90    90

In [111]:
df = df.T
print(df)

   name math eng music science
0  stu1   90  98    85     100
1  stu2   80  89    95      90
2  stu3   70  95   100      90

In [ ]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [113]:
df

   name math eng music science
0  stu1   90  98    85     100
1  stu2   80  89    95      90
2  stu3   70  95   100      90

In [115]:
ndf = df.set_index(['name'])
print(ndf)
print("\n")
ndf2 =  df.set_index('music')
print(ndf2)
print("\n")
ndf3 = ndf.set_index(['math', 'music'])
print(ndf3)

     math eng music science
name
stu1   90  98    85     100
stu2   80  89    95      90
stu3   70  95   100      90


       name math eng science
music
85     stu1   90  98     100
95     stu2   80  89      90
100    stu3   70  95      90


           eng science
math music
90   85     98     100
80   95     89      90
70   100    95      90

In [120]:
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9], 'c3': [10, 11, 12], 'c4': [13, 14, 15]}
df1 = pd.DataFrame(dict_data)
print(df1)
print("----------------------------------------------------")
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15
----------------------------------------------------
    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [121]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [122]:
ndf = df.reindex(new_index, fill_value = 0)
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [123]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [124]:
ndf = df.reset_index()
print(ndf)

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [142]:
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9], 'c3': [10, 11, 12], 'c4': [13, 14, 15]}
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [126]:
ndf = df.sort_index(ascending=False)
print(ndf)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [143]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [144]:
ndf = df.sort_values(by = 'c1', ascending=False)

In [145]:
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [146]:
student1 = pd.Series({'eng': 100, 'math': 80, 'science': 90})
print(student1)

eng        100
math        80
science     90
dtype: int64

In [147]:
percentage = student1/200
print(percentage)
print("\n")
print(type(percentage))

eng        0.50
math       0.40
science    0.45
dtype: float64


<class 'pandas.core.series.Series'>

In [149]:
student1 = pd.Series({'eng': 100, 'math': 80, 'science': 90})
student2 = pd.Series({'science': 80, 'eng': 90, 'math': 80})
print(student1)
print("------------")
print(student2)

eng        100
math        80
science     90
dtype: int64
------------
science    80
eng        90
math       80
dtype: int64

In [154]:
add = student1 + student2
print(add)

eng        190
math       160
science    170
dtype: int64

In [155]:
sub = student1 - student2
print(sub)

eng        10
math        0
science    10
dtype: int64

In [156]:
mul = student1 * student2
print(mul)

eng        9000
math       6400
science    7200
dtype: int64

In [157]:
div = student1 / student2
print(div)

eng        1.111111
math       1.000000
science    1.125000
dtype: float64

In [158]:
print(type(div))

<class 'pandas.core.series.Series'>

In [159]:
res = pd.DataFrame([add, sub, mul, div], index = ['addition', 'subtraction', 'multiplication', 'division'])
print(res)

                        eng    math   science
addition         190.000000   160.0   170.000
subtraction       10.000000     0.0    10.000
multiplication  9000.000000  6400.0  7200.000
division           1.111111     1.0     1.125

In [160]:
student1 = pd.Series({'eng': np.nan, 'math': 80, 'science': 90})
student2 = pd.Series({'science': 80, 'eng': 90, 'math': 80})
print(student1)
print("------------")
print(student2)

eng         NaN
math       80.0
science    90.0
dtype: float64
------------
science    80
eng        90
math       80
dtype: int64

In [161]:
sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)
sr_mul = student1.mul(student2, fill_value=0)
sr_div = student1.div(student2, fill_value=0)
print(type(sr_add))

<class 'pandas.core.series.Series'>

In [162]:
print(sr_div)

eng        0.000
math       1.000
science    1.125
dtype: float64

In [163]:
res = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div])
print(res)

    eng    math   science
0  90.0   160.0   170.000
1 -90.0     0.0    10.000
2   0.0  6400.0  7200.000
3   0.0     1.0     1.125